; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-40)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b11)
    (on-table b11)
    (clear b9)
    (on b9 b6)
    (on b6 b4)
    (on-table b4)
    (clear b5)
    (on b5 b3)
    (on b3 b10)
    (on b10 b8)
    (on b8 b7)
    (on b7 b12)
    (on b12 b2)
    (on-table b2))
 (:goal (and 
(on-table b1)
(on-table b5)
(on-table b8)
(on b4 b5)
(clear b7) (on b7 b4)
(on b10 b1)
))
)

; plan
1. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 0 of 7
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 7
3. (unstack b5 b3)
   deleted: (on b5 b3) (clear b5) (arm-empty)
   added: (holding b5) (clear b3)
   goals met: 1 of 7
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 7
5. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 2 of 7
6. (stack b3 b11)
   deleted: (clear b11) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b11)
   goals met: 2 of 7
7. (unstack b10 b8)
   deleted: (on b10 b8) (clear b10) (arm-empty)
   added: (holding b10) (clear b8)
   goals met: 2 of 7
8. (stack b10 b1)
   deleted: (clear b1) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b1)
   goals met: 3 of 7
9. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 4 of 7
10. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 5 of 7
11. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 5 of 7
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 7
13. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 5 of 7
14. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 7
15. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 7
16. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 6 of 7
17. (unstack b7 b12)
   deleted: (on b7 b12) (clear b7) (arm-empty)
   added: (holding b7) (clear b12)
   goals met: 5 of 7
18. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 7 of 7
